In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [5]:
data = pd.read_csv("Income Dataset.csv")

             Position  Level   Salary
0    Business Analyst    1.0    45000
1   Junior Consultant    2.0    50000
2   Senior Consultant    3.0    60000
3             Manager    4.0    80000
4     Country Manager    5.0   110000
5      Region Manager    6.0   150000
6             Partner    7.0   200000
7      Senior Partner    8.0   300000
8             C-level    9.0   500000
9                 CEO   10.0  1000000
10                NaN    NaN  1500000
11                NaN    NaN  2000000
12    Senior Enginner    3.5    65000
13          Tech Lead    4.5    85000